foxval/esp-idf/components/soc/esp32c/include/soc/spi_struct.h
            uint32_t in_suc_eof:                 1;       /*The raw bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;       /*The raw bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                    1;       /*The raw bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;       /*The raw bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;       /*reserved*/
        };
        uint32_t val;
    } dma_int_raw;
    union {
        struct {
            uint32_t inlink_dscr_empty:         1;        /*The status bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:        1;        /*The status bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:         1;        /*The status bit for inlink descriptor error.*/
            uint32_t in_done:                   1;        /*The status bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                1;        /*The status bit for receiving error.*/
            uint32_t in_suc_eof:                1;        /*The status bit for completing receiving all the packets from host.*/
            uint32_t out_done:                  1;        /*The status bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                   1;        /*The status bit for sending a packet to host done.*/
            uint32_t out_total_eof:             1;        /*The status bit for sending all the packets to host done.*/
            uint32_t reserved9:                23;        /*reserved*/
        };
        uint32_t val;
    } dma_int_st;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;       /*The clear bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;       /*The clear bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;       /*The clear bit for inlink descriptor error.*/
            uint32_t in_done:                    1;       /*The clear bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;       /*The clear bit for receiving error.*/
            uint32_t in_suc_eof:                 1;       /*The clear bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;       /*The clear bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                    1;       /*The clear bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;       /*The clear bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;       /*reserved*/
        };
        uint32_t val;
    } dma_int_clr;
    uint32_t dma_in_err_eof_des_addr;                         /*The inlink descriptor address when spi dma produce receiving error.*/
    uint32_t dma_in_suc_eof_des_addr;                         /*The last inlink descriptor address when spi dma produce from_suc_eof.*/
    uint32_t dma_inlink_dscr;                                 /*The content of current in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf0;                             /*The content of next in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf1;                             /*The content of current in descriptor data buffer pointer.*/
    uint32_t dma_out_eof_bfr_des_addr;                        /*The address of buffer relative to the outlink descriptor that produce eof.*/
    uint32_t dma_out_eof_des_addr;                            /*The last outlink descriptor address when spi dma produce to_eof.*/
    uint32_t dma_outlink_dscr;                                /*The content of current out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf0;                            /*The content of next out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf1;                            /*The content of current out descriptor data buffer pointer.*/
    union {
        struct {
            uint32_t out_dscr_addr:    18;                /*SPI dma out descriptor address.*/
            uint32_t out_dscr_state:    2;                /*SPI dma out descriptor state.*/
            uint32_t out_state:         3;                /*SPI dma out data state.*/
            uint32_t out_fifo_cnt:      7;                /*The remains of SPI dma outfifo data.*/
            uint32_t out_fifo_full:     1;                /*SPI dma outfifo is full.*/
            uint32_t out_fifo_empty:    1;                /*SPI dma outfifo is empty.*/
        };
        uint32_t val;
    } dma_out_status;
    union {
        struct {
            uint32_t in_dscr_addr:    18;                 /*SPI dma in descriptor address.*/
            uint32_t in_dscr_state:    2;                 /*SPI dma in descriptor state.*/
            uint32_t in_state:         3;                 /*SPI dma in data state.*/
            uint32_t in_fifo_cnt:      7;                 /*The remains of SPI dma infifo data.*/
            uint32_t in_fifo_full:     1;                 /*SPI dma infifo is full.*/
            uint32_t in_fifo_empty:    1;                 /*SPI dma infifo is empty.*/
        };
        uint32_t val;
    } dma_in_status;
    uint32_t data_buf[18];                                          /*data buffer*/
    union {
        struct {
            uint32_t din0_mode:     2;                    /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din1_mode:     2;                    /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din2_mode:     2;                    /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din3_mode:     2;                    /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t reserved8:    10;
            uint32_t din0_dly_edge: 1;                    /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t din1_dly_edge: 1;                    /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t din2_dly_edge: 1;                    /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t din3_dly_edge: 1;                    /*The bit is used to select the spi clock edge to modify input line timing.*/
            uint32_t reserved22:   10;                    /*reserved*/
        };
        uint32_t val;
    } din_mode;
    union {
        struct {
            uint32_t din0_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din1_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din2_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din3_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved8: 24;                       /*reserved*/
        };
        uint32_t val;
    } din_num;
    union {
        struct {
            uint32_t dout0_mode:     2;                   /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout1_mode:     2;                   /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout2_mode:     2;                   /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout3_mode:     2;                   /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout4_mode:     2;                   /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t reserved10:     8;                   /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout0_dly_edge: 1;                   /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout1_dly_edge: 1;                   /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout2_dly_edge: 1;                   /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout3_dly_edge: 1;                   /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t dout4_dly_edge: 1;                   /*The bit is used to select the spi clock edge to modify output line timing.*/
            uint32_t reserved23:     9;                   /*reserved*/
        };
        uint32_t val;
    } dout_mode;
    union {
        struct {
            uint32_t dout0_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout1_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout2_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout3_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout4_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved10:22;                       /*reserved*/
        };
        uint32_t val;
    } dout_num;
    union {
        struct {
            uint32_t sop_en:       1;
            uint32_t sop_mode:     4;
            uint32_t sop_rcmd:     8;
            uint32_t sop_wcmd:     8;
            uint32_t sop_dqs_edge: 1;
            uint32_t reserved22:  10;
        };
        uint32_t val;
    } spr_cfg0;
    union {
        struct {
            uint32_t sop_itl:    12;
            uint32_t sop_len:     6;
            uint32_t sop_dlen:    6;
            uint32_t sop_dc_mode: 1;
            uint32_t reserved25:  7;
        };
        uint32_t val;
    } spr_cfg1;
    uint32_t reserved_104;
    uint32_t reserved_108;
    uint32_t reserved_10c;
    uint32_t reserved_110;
    uint32_t reserved_114;
    uint32_t reserved_118;
    uint32_t reserved_11c;
    uint32_t reserved_120;
    uint32_t reserved_124;
    uint32_t reserved_128;
    uint32_t reserved_12c;
    uint32_t reserved_130;
    uint32_t reserved_134;
    uint32_t reserved_138;
    uint32_t reserved_13c;
    uint32_t reserved_140;
    uint32_t reserved_144;
    uint32_t reserved_148;
    uint32_t reserved_14c;
    uint32_t reserved_150;
    uint32_t reserved_154;
    uint32_t reserved_158;
    uint32_t reserved_15c;
    uint32_t reserved_160;
    uint32_t reserved_164;
    uint32_t reserved_168;
    uint32_t reserved_16c;
    uint32_t reserved_170;
    uint32_t reserved_174;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    uint32_t reserved_180;
    uint32_t reserved_184;
    uint32_t reserved_188;
    uint32_t reserved_18c;
    uint32_t reserved_190;
    uint32_t reserved_194;
    uint32_t reserved_198;
    uint32_t reserved_19c;
    uint32_t reserved_1a0;
    uint32_t reserved_1a4;
    uint32_t reserved_1a8;
    uint32_t reserved_1ac;
    uint32_t reserved_1b0;
    uint32_t reserved_1b4;
    uint32_t reserved_1b8;
    uint32_t reserved_1bc;
    uint32_t reserved_1c0;
    uint32_t reserved_1c4;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    uint32_t reserved_1d0;
    uint32_t reserved_1d4;
    uint32_t reserved_1d8;
    uint32_t reserved_1dc;
    uint32_t reserved_1e0;
    uint32_t reserved_1e4;
    uint32_t reserved_1e8;
    uint32_t reserved_1ec;
    uint32_t reserved_1f0;
    uint32_t reserved_1f4;
    uint32_t reserved_1f8;
    uint32_t reserved_1fc;
    uint32_t reserved_200;
    uint32_t reserved_204;
    uint32_t reserved_208;
    uint32_t reserved_20c;
    uint32_t reserved_210;
    uint32_t reserved_214;
    uint32_t reserved_218;
    uint32_t reserved_21c;
    uint32_t reserved_220;
    uint32_t reserved_224;
    uint32_t reserved_228;
    uint32_t reserved_22c;
    uint32_t reserved_230;
    uint32_t reserved_234;
    uint32_t reserved_238;
    uint32_t reserved_23c;
    uint32_t reserved_240;
    uint32_t reserved_244;
    uint32_t reserved_248;
    uint32_t reserved_24c;
    uint32_t reserved_250;
    uint32_t reserved_254;
    uint32_t reserved_258;
    uint32_t reserved_25c;
    uint32_t reserved_260;
    uint32_t reserved_264;
    uint32_t reserved_268;
    uint32_t reserved_26c;
    uint32_t reserved_270;
    uint32_t reserved_274;
    uint32_t reserved_278;
    uint32_t reserved_27c;
    uint32_t reserved_280;
    uint32_t reserved_284;
    uint32_t reserved_288;
    uint32_t reserved_28c;
    uint32_t reserved_290;
    uint32_t reserved_294;
    uint32_t reserved_298;
    uint32_t reserved_29c;
    uint32_t reserved_2a0;
    uint32_t reserved_2a4;
    uint32_t reserved_2a8;
    uint32_t reserved_2ac;
    uint32_t reserved_2b0;
    uint32_t reserved_2b4;
    uint32_t reserved_2b8;
    uint32_t reserved_2bc;
    uint32_t reserved_2c0;
    uint32_t reserved_2c4;
    uint32_t reserved_2c8;
    uint32_t reserved_2cc;
    uint32_t reserved_2d0;
    uint32_t reserved_2d4;
    uint32_t reserved_2d8;
    uint32_t reserved_2dc;
    uint32_t reserved_2e0;
    uint32_t reserved_2e4;
    uint32_t reserved_2e8;
    uint32_t reserved_2ec;
    uint32_t reserved_2f0;
    uint32_t reserved_2f4;
    uint32_t reserved_2f8;
    uint32_t reserved_2fc;
    uint32_t reserved_300;
    uint32_t reserved_304;
    uint32_t reserved_308;
    uint32_t reserved_30c;
    uint32_t reserved_310;
    uint32_t reserved_314;
    uint32_t reserved_318;
    uint32_t reserved_31c;
    uint32_t reserved_320;
    uint32_t reserved_324;
    uint32_t reserved_328;
    uint32_t reserved_32c;
    uint32_t reserved_330;
    uint32_t reserved_334;
    uint32_t reserved_338;
    uint32_t reserved_33c;
    uint32_t reserved_340;
    uint32_t reserved_344;
    uint32_t reserved_348;
    uint32_t reserved_34c;
    uint32_t reserved_350;
    uint32_t reserved_354;
    uint32_t reserved_358;
    uint32_t reserved_35c;
    uint32_t reserved_360;
    uint32_t reserved_364;
    uint32_t reserved_368;
    uint32_t reserved_36c;
    uint32_t reserved_370;
    uint32_t reserved_374;
    uint32_t reserved_378;
    uint32_t reserved_37c;
    uint32_t reserved_380;
    uint32_t reserved_384;
    uint32_t reserved_388;
    uint32_t reserved_38c;
    uint32_t reserved_390;
    uint32_t reserved_394;
    uint32_t reserved_398;
    uint32_t reserved_39c;
    uint32_t reserved_3a0;
    uint32_t reserved_3a4;
    uint32_t reserved_3a8;
    uint32_t reserved_3ac;
    uint32_t reserved_3b0;
    uint32_t reserved_3b4;
    uint32_t reserved_3b8;
    uint32_t reserved_3bc;
    uint32_t reserved_3c0;
    uint32_t reserved_3c4;
    uint32_t reserved_3c8;
    uint32_t reserved_3cc;
    uint32_t reserved_3d0;
    uint32_t reserved_3d4;
    uint32_t reserved_3d8;
    uint32_t reserved_3dc;
    uint32_t reserved_3e0;
    uint32_t reserved_3e4;
    uint32_t reserved_3e8;
    uint32_t reserved_3ec;
    uint32_t reserved_3f0;
    uint32_t reserved_3f4;
    uint32_t reserved_3f8;
    union {
        struct {
            uint32_t date:      28;                       /*SPI register version.*/
            uint32_t reserved28: 4;                       /*reserved*/
        };
        uint32_t val;
    } date;
} spi_dev_t;
extern spi_dev_t GPSPI2;
extern spi_dev_t GPSPI3;
extern spi_dev_t GPSPI4;
#ifdef __cplusplus
}
#endif

#endif  /* _SOC_SPI_STRUCT_H_ */
